[
  {
    "Name": "Melt butter and beat with sugar and vanilla sugar.",
    "Step": 1,
    "IdRecipe": 1,
    "Id": 1
  },
  {
    "Name": "Add eggs, beat.",
    "Step": 2,
    "IdRecipe": 1,
    "Id": 2
  },
  {
    "Name": "Pour in kefir, mix.",
    "Step": 3,
    "IdRecipe": 1,
    "Id": 3
  },
  {
    "Name": "Gradually add flour and baking powder and beat until smooth.",
    "Step": 4,
    "IdRecipe": 1,
    "Id": 4
  },
  {
    "Name": "Divide the dough into two parts, add cocoa to one part, mix thoroughly.",
    "Step": 5,
    "IdRecipe": 1,
    "Id": 5
  },
  {
    "Name": "In a baking dish (I have a silicone one), spread the dough with tablespoons alternately dark and light, in random order, without stirring. Bake Zebra cake at 190 degrees for 40-45 minutes. Willingness to check with a wooden stick.",
    "Step": 6,
    "IdRecipe": 1,
    "Id": 6
  },
  {
    "Name": "Sprinkle the finished Zebra cake with powdered sugar. Bon appetit, please your loved ones!",
    "Step": 7,
    "IdRecipe": 1,
    "Id": 7
  },
  {
    "Name": "Mix all ingredients.",
    "Step": 1,
    "IdRecipe": 3,
    "Id": 8
  },
  {
    "Name": "Put butter to the baking muffin cups.",
    "Step": 2,
    "IdRecipe": 3,
    "Id": 9
  },
  {
    "Name": "Bake for 30 minutes at 350 °F (175 °C).",
    "Step": 3,
    "IdRecipe": 3,
    "Id": 10
  },
  {
    "Name": "Let cool. Enjoy.",
    "Step": 4,
    "IdRecipe": 3,
    "Id": 11
  },
  {
    "Name": "Preheat oven to 425°F.",
    "Step": 1,
    "IdRecipe": 4,
    "Id": 12
  },
  {
    "Name": "In a medium bowl whisk together flour, baking powder, and salt. Cut butter into chunks and cut into flour using fingers or a pastry cutter until the size of small peas.",
    "Step": 2,
    "IdRecipe": 4,
    "Id": 13
  },
  {
    "Name": "Add sugar and slowly mix in kefir until a dough forms. The dough should just hold together and not be too sticky. Knead briefly to bring the dough together and turn out onto a floured surface.",
    "Step": 3,
    "IdRecipe": 4,
    "Id": 14
  },
  {
    "Name": "Roll out into a 1 1/2-inch thick round or rectangle. Use a 2-inch biscuit cutter to cut out the scones and transfer to a baking sheet. Knead together scraps and cut into more scones until all of the dough is used up.",
    "Step": 4,
    "IdRecipe": 4,
    "Id": 15
  },
  {
    "Name": "Bake 10-15 minutes. Transfer to a cooling rack and serve warm with cultured butter, clotted or whipped cream, and jam.",
    "Step": 5,
    "IdRecipe": 4,
    "Id": 16
  },
  {
    "Name": "Pre-heat oven to 350° F (175° C). Grease 8\" square baking pan.",
    "Step": 1,
    "IdRecipe": 5,
    "Id": 17
  },
  {
    "Name": "Combine flour, cocoa and salt in small bowl. Beat butter, granulated sugar and brown sugar in large mixer bowl until creamy. Add 2 eggs, one at a time, beating well after each addition. Add vanilla extract; mix well.",
    "Step": 2,
    "IdRecipe": 5,
    "Id": 18
  },
  {
    "Name": "Gradually beat in flour mixture. Reserve 3/4 cup batter. Spread remaining batter into prepared baking pan. Sprinkle nuts and white morsels over batter. Drizzle caramel topping over top.",
    "Step": 3,
    "IdRecipe": 5,
    "Id": 19
  },
  {
    "Name": "Beat remaining egg and reserved batter in same large bowl until light in color.",
    "Step": 4,
    "IdRecipe": 5,
    "Id": 20
  },
  {
    "Name": "Stir in semi-sweet morsels (like Toll House brand). Spread evenly over caramel topping.",
    "Step": 5,
    "IdRecipe": 5,
    "Id": 21
  },
  {
    "Name": "Bake for 30 to 35 minutes or until center is set.",
    "Step": 6,
    "IdRecipe": 5,
    "Id": 22
  },
  {
    "Name": "Cool completely in pan on wire rack. Cut into squares.",
    "Step": 7,
    "IdRecipe": 5,
    "Id": 23
  },
  {
    "Name": "Note: based on Nestle Toll House recipe.",
    "Step": 8,
    "IdRecipe": 5,
    "Id": 24
  },
  {
    "Name": "Heat the oil in a deep frying pan and add the onion. Cook over a medium heat for 5 mins until starting to soften. Add the chorizo and cook for another few mins to release the oil. Coat the onion in the chorizo oil, then tip in the tomatoes. Fill the can with water and tip that in too. Season and bring to the boil.",
    "Step": 1,
    "IdRecipe": 6,
    "Id": 25
  },
  {
    "Name": "Once boiling, season the cod fillets and nestle into the pan. Reduce the heat and gently simmer for about 7 mins. Gently mix in the butter beans and cook for 1-2 mins more until hot. Scatter with parsley and serve in bowls.",
    "Step": 2,
    "IdRecipe": 6,
    "Id": 26
  },
  {
    "Name": "In a medium saucepan, bring water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes.",
    "Step": 1,
    "IdRecipe": 7,
    "Id": 27
  },
  {
    "Name": "Bring a large, wide saucepan of lightly salted water to a boil. Add cabbage leaves and cook for 2 to 4 minutes or until softened; drain.",
    "Step": 2,
    "IdRecipe": 7,
    "Id": 28
  },
  {
    "Name": "In a medium mixing bowl, combine the ground beef, 1 cup cooked rice, onion, egg, salt and pepper, along with 2 tablespoons of tomato soup. Mix thoroughly.",
    "Step": 3,
    "IdRecipe": 7,
    "Id": 29
  },
  {
    "Name": "Divide the beef mixture evenly among the cabbage leaves. Roll and secure them with toothpicks or string.",
    "Step": 4,
    "IdRecipe": 7,
    "Id": 30
  },
  {
    "Name": "In a large skillet over medium heat, place the cabbage rolls and pour the remaining tomato soup over the top. Cover and bring to a boil. Reduce heat to low and simmer for about 40 minutes, stirring and basting with the liquid often.",
    "Step": 5,
    "IdRecipe": 7,
    "Id": 31
  },
  {
    "Name": "In a deep dish skillet with a small amount of oil, brown ground beef, and onion. Drain.",
    "Step": 1,
    "IdRecipe": 8,
    "Id": 32
  },
  {
    "Name": "Add the minced garlic to the ground beef with onions and give it a quick saute.",
    "Step": 2,
    "IdRecipe": 8,
    "Id": 33
  },
  {
    "Name": "Add in water, diced tomatoes and tomato sauce. Season with salt and pepper. Toss in the uncooked rice at this point if using.",
    "Step": 3,
    "IdRecipe": 8,
    "Id": 34
  },
  {
    "Name": "Place chopped cabbage in pan, and toss to combine all ingredients.",
    "Step": 4,
    "IdRecipe": 8,
    "Id": 35
  },
  {
    "Name": "Cover the pan with lid and simmer for 30 minutes or until cabbage has cooked.",
    "Step": 5,
    "IdRecipe": 8,
    "Id": 36
  },
  {
    "Name": "Before marinating, you need to prepare the carcass: remove the remnants of feathers and down, if necessary, burn with a gas burner, wash and dry. I cut off the outer wing phalanges, which contain almost no meat and burn when baked. I also removed the sebaceous gland from the tail, which gives off an unpleasant odor when baked. The neck can be cut off or left as you wish.",
    "Step": 1,
    "IdRecipe": 9,
    "Id": 37
  },
  {
    "Name": "For the marinade, I combined in a small bowl: soy sauce, honey, grated ginger, salt, pepper, lemon juice, and garlic, passed through a press (you can use granulated). She whisked all the ingredients with a whisk to completely dissolve the honey and salt.",
    "Step": 2,
    "IdRecipe": 9,
    "Id": 38
  },
  {
    "Name": "The resulting fragrant mixture rubbed the carcass outside and inside.",
    "Step": 3,
    "IdRecipe": 9,
    "Id": 39
  },
  {
    "Name": "Packed it into a baking sleeve, poured the remaining sauce there. Left to marinate for at least 4-6 hours (preferably overnight) in the refrigerator.",
    "Step": 4,
    "IdRecipe": 9,
    "Id": 40
  },
  {
    "Name": "Then she sent the duck to the oven, heated to 160-180 degrees - the bird should lie breast down. Baked for 2 hours. After the indicated time, she carefully cut the sleeve and pierced a large joint with a knife to make sure the meat was ready. If a clear liquid flows out, you can turn off the oven.",
    "Step": 5,
    "IdRecipe": 9,
    "Id": 41
  },
  {
    "Name": "Duck baked in a sleeve in the oven is very tasty, soft and juicy, ruddy, smells like ginger and honey. It remains to be divided into portions and can be served at the table. Buckwheat with mushrooms, mashed potatoes, sauerkraut and other pickles are suitable for garnish. Do not rush to pour out the melted duck fat, it is perfect for frying potatoes.",
    "Step": 6,
    "IdRecipe": 9,
    "Id": 42
  },
  {
    "Name": "Separate the yolks from the whites and beat with half the butter, cinnamon and sugar until the crystals are completely dissolved. Beat the whites to form a dense foam.",
    "Step": 1,
    "IdRecipe": 10,
    "Id": 43
  },
  {
    "Name": "Heat the remaining oil in a skillet over medium heat. Fry the oatmeal for 8-10 minutes, stirring constantly. Cool it down.",
    "Step": 2,
    "IdRecipe": 10,
    "Id": 44
  },
  {
    "Name": "Combine the oatmeal with the egg-sugar mixture and flour. Then add the proteins and stir.",
    "Step": 3,
    "IdRecipe": 10,
    "Id": 45
  },
  {
    "Name": "Line a baking sheet with parchment paper and spoon the mixture onto it. Bake for about 15 minutes at 180 ° C.",
    "Step": 4,
    "IdRecipe": 10,
    "Id": 46
  },
  {
    "Name": "Grind the raisins in a blender. Then whisk with sugar, vanilla and room temperature butter to make a lump-free mixture.",
    "Step": 1,
    "IdRecipe": 11,
    "Id": 47
  },
  {
    "Name": "Dissolve the salt in water, add together with cinnamon and oat flour to the resulting mass. Stir and, gradually adding wheat flour, knead the dough.",
    "Step": 2,
    "IdRecipe": 11,
    "Id": 48
  },
  {
    "Name": "Roll it out so that the thickness of the layer is about 7-8 mm. Use a glass or a special cookie cutter to make round cookies. Transfer the pieces to a baking sheet lined with parchment paper. Bake for 10-12 minutes at 200 ° C.",
    "Step": 3,
    "IdRecipe": 11,
    "Id": 49
  },
  {
    "Name": "Grind the oatmeal in a blender. Combine flour with baking soda.",
    "Step": 1,
    "IdRecipe": 12,
    "Id": 50
  },
  {
    "Name": "Mash butter at room temperature with sugar. Add honey, sour cream, egg and beat with a mixer. Then stir in the oatmeal. Add the flour and baking soda mixture little by little and knead the dough.",
    "Step": 2,
    "IdRecipe": 12,
    "Id": 51
  },
  {
    "Name": "Line a baking sheet with parchment paper and spoon over the cookies. Bake for 10-15 minutes at 200 ° C.",
    "Step": 3,
    "IdRecipe": 12,
    "Id": 52
  },
  {
    "Name": "Divide the eggs into whites and yolks.",
    "Step": 1,
    "IdRecipe": 13,
    "Id": 53
  },
  {
    "Name": "Beat the yolks with sugar.",
    "Step": 2,
    "IdRecipe": 13,
    "Id": 54
  },
  {
    "Name": "Beat the yolks with sugar.",
    "Step": 3,
    "IdRecipe": 13,
    "Id": 55
  },
  {
    "Name": "Then add soda, extinguish with vinegar.",
    "Step": 4,
    "IdRecipe": 13,
    "Id": 56
  },
  {
    "Name": "Gradually add the sifted flour.",
    "Step": 5,
    "IdRecipe": 13,
    "Id": 57
  },
  {
    "Name": "Beat the whites separately with a pinch of salt until stable peaks.",
    "Step": 6,
    "IdRecipe": 13,
    "Id": 58
  },
  {
    "Name": "Add whites to yolks, mix gently. Divide the dough into 2 unequal parts.",
    "Step": 7,
    "IdRecipe": 13,
    "Id": 59
  },
  {
    "Name": "Pour the larger one into a mold covered with paper. Bake at 180 degrees for 20-30 minutes.",
    "Step": 8,
    "IdRecipe": 13,
    "Id": 60
  },
  {
    "Name": "Add cocoa to a small part, mix. Bake the same way.",
    "Step": 9,
    "IdRecipe": 13,
    "Id": 61
  },
  {
    "Name": "Cut the chocolate part into figures.",
    "Step": 10,
    "IdRecipe": 13,
    "Id": 62
  },
  {
    "Name": "Cut the white part into 2 cakes.",
    "Step": 11,
    "IdRecipe": 13,
    "Id": 63
  },
  {
    "Name": "For cream, mix sour cream and powdered sugar. Dip each chocolate figurine in sour cream.",
    "Step": 12,
    "IdRecipe": 13,
    "Id": 64
  },
  {
    "Name": "Gently fold the figures, pour the remaining sour cream to make a full-fledged cake. You can also use jam or chocolate paste for the filling.",
    "Step": 13,
    "IdRecipe": 13,
    "Id": 65
  },
  {
    "Name": "Prepare foods for semolina pie.",
    "Step": 1,
    "IdRecipe": 14,
    "Id": 66
  },
  {
    "Name": "How to make a pie with kefir with semolina: Pour kefir",
    "Step": 2,
    "IdRecipe": 14,
    "Id": 67
  },
  {
    "Name": "Add a glass of semolina, stir and leave for 40 minutes (so that the semolina swells).",
    "Step": 3,
    "IdRecipe": 14,
    "Id": 68
  },
  {
    "Name": "Prepare a mold (a miracle, or a cake pan - with a hole in the middle), grease it with oil and sprinkle with flour (1 tbsp. Spoon). Pour excess flour.",
    "Step": 4,
    "IdRecipe": 14,
    "Id": 69
  },
  {
    "Name": "Pour a glass of granulated sugar into the dough, stir.",
    "Step": 5,
    "IdRecipe": 14,
    "Id": 70
  },
  {
    "Name": "Stir 3-4 tablespoons of wheat flour with 1 teaspoon of soda (no top), add to the dough.",
    "Step": 6,
    "IdRecipe": 14,
    "Id": 71
  },
  {
    "Name": "Mix quickly and thoroughly, without wasting a second, gently pour the dough into the mold.",
    "Step": 7,
    "IdRecipe": 14,
    "Id": 72
  },
  {
    "Name": "Place in a preheated oven. Bake the manna until tender for about 35-40 minutes.",
    "Step": 8,
    "IdRecipe": 14,
    "Id": 73
  },
  {
    "Name": "The semolina pie is ready. Enjoy your meal!",
    "Step": 9,
    "IdRecipe": 14,
    "Id": 74
  },
  {
    "Name": "Combine eggs with sugar, stir for a minute with a whisk.",
    "Step": 1,
    "IdRecipe": 15,
    "Id": 75
  },
  {
    "Name": "We send the cup to the \"water bath\" so that the bottom does not touch the water (moderate heating). Stirring constantly, wait for the sugar to completely dissolve. With this amount of sugar, eggs will not boil, do not worry.",
    "Step": 2,
    "IdRecipe": 15,
    "Id": 76
  },
  {
    "Name": "Then everything is as usual.",
    "Step": 3,
    "IdRecipe": 15,
    "Id": 77
  },
  {
    "Name": "Add baking powder to the flour, mix well.",
    "Step": 4,
    "IdRecipe": 15,
    "Id": 78
  },
  {
    "Name": "In another bowl, mix cocoa with a small amount of dough.",
    "Step": 5,
    "IdRecipe": 15,
    "Id": 79
  },
  {
    "Name": "Thus, mix half of the dough with cocoa.",
    "Step": 6,
    "IdRecipe": 15,
    "Id": 80
  },
  {
    "Name": "We turn on the oven to heat up to 180 degrees.",
    "Step": 7,
    "IdRecipe": 15,
    "Id": 81
  },
  {
    "Name": "Alternating white and chocolate dough, pour two to three tablespoons into the center. When all the dough has been poured, carefully remove the film.",
    "Step": 8,
    "IdRecipe": 15,
    "Id": 82
  },
  {
    "Name": "We bake Zebra cake on kefir and vegetable oil in a preheated oven for 40 minutes, temperature - 170-180 degrees. Focus on your oven.",
    "Step": 9,
    "IdRecipe": 15,
    "Id": 83
  },
  {
    "Name": "This \"Zebra\" cake never falls off, the dough does not crumble, it is moderately moist. Very tasty and there is always a uniform pattern in every piece of the pie. Try it, bake to your health!",
    "Step": 10,
    "IdRecipe": 15,
    "Id": 84
  },
  {
    "Name": "Dough for khychins: 0.5 l of sour milk, do not extinguish soda, a little salt, flour.",
    "Step": 1,
    "IdRecipe": 16,
    "Id": 85
  },
  {
    "Name": "We knead the hard dough, let it rest.",
    "Step": 2,
    "IdRecipe": 16,
    "Id": 86
  },
  {
    "Name": "Filling: boil potatoes, make mashed potatoes, grate cheese separately, mix with potatoes. We take a little dough, knead it with our hands and make a small cake. Put the filling on the cakes. It is very important: the amount of filling by volume must be equal (not less) to the volume of the dough. Then we pinch the cakes into a bundle. It turns out a kind of donuts.",
    "Step": 3,
    "IdRecipe": 16,
    "Id": 87
  },
  {
    "Name": "We take each donut in our hands and begin to form a flat cake out of it with our fingers, \"flatten\" it. The most important stage comes: carefully, gently, so as not to tear the dough, we begin to roll the cake into a very thin (about 5 mm, the thinner - the better!) Pancake. In size, it should be just the size of the pan.",
    "Step": 4,
    "IdRecipe": 16,
    "Id": 88
  },
  {
    "Name": "Next, you need to thoroughly warm up the pan (dry, completely without oil!). Khychins on kefir with cheese and potatoes are baked easily and quickly, sometimes they bubble up in a frying pan (from the fact that air remains in the filling when pinching), you just need to pierce them.",
    "Step": 5,
    "IdRecipe": 16,
    "Id": 89
  },
  {
    "Name": "After baking, each khychin should be liberally greased with butter on both sides and put into a beautiful pile. The khychins \"soften\" and become very tender.",
    "Step": 6,
    "IdRecipe": 16,
    "Id": 90
  },
  {
    "Name": "Enjoy your meal!",
    "Step": 7,
    "IdRecipe": 16,
    "Id": 91
  },
  {
    "Name": "Cooking kefir cupcakes with raisins. Pour the raisins with tea, water or cognac. We leave for 20-30 minutes to soften the raisins.",
    "Step": 1,
    "IdRecipe": 17,
    "Id": 92
  },
  {
    "Name": "We put the soft raisins on a sieve. We get rid of unnecessary liquid.",
    "Step": 2,
    "IdRecipe": 17,
    "Id": 93
  },
  {
    "Name": "We add soda to kefir.",
    "Step": 3,
    "IdRecipe": 17,
    "Id": 94
  },
  {
    "Name": "Beat the egg with sugar for 2-3 minutes, until smooth.",
    "Step": 4,
    "IdRecipe": 17,
    "Id": 95
  },
  {
    "Name": "Add melted butter and kefir with soda to the egg mixture. Mix with a mixer.",
    "Step": 5,
    "IdRecipe": 17,
    "Id": 96
  },
  {
    "Name": "Gradually add flour to the mixture. Stir on a slow mixer speed until smooth.",
    "Step": 6,
    "IdRecipe": 17,
    "Id": 97
  },
  {
    "Name": "Add raisins to the dough and stir in with a spatula.",
    "Step": 7,
    "IdRecipe": 17,
    "Id": 98
  },
  {
    "Name": "Insert paper cupcake cups into metal molds. We spread the dough into molds. The specified amount of ingredients is enough for 10 molds with a diameter of 5 cm.",
    "Step": 8,
    "IdRecipe": 17,
    "Id": 99
  },
  {
    "Name": "We put the molds with dough not in a hot, but in a warm oven preheated to 50-80 degrees. We bake the muffins for 30 minutes at 180 degrees. This will help the cupcakes rise more evenly. If you are baking another batch of muffins, let the oven cool down before baking and then bake the second batch. We check the readiness of the cupcakes with a wooden stick. Keep the stick dry when piercing the muffins.",
    "Step": 9,
    "IdRecipe": 17,
    "Id": 100
  },
  {
    "Name": "Cool the finished muffins and sprinkle with powdered sugar. How delicious!",
    "Step": 10,
    "IdRecipe": 17,
    "Id": 101
  },
  {
    "Name": "The products required for the manna recipe are in front of you.",
    "Step": 1,
    "IdRecipe": 18,
    "Id": 102
  },
  {
    "Name": "How to cook a manna in butter: Melt the butter over the lowest heat.",
    "Step": 2,
    "IdRecipe": 18,
    "Id": 103
  },
  {
    "Name": "Pour sugar into a bowl, beat in chicken eggs.",
    "Step": 3,
    "IdRecipe": 18,
    "Id": 104
  },
  {
    "Name": "Grind eggs with sugar.",
    "Step": 4,
    "IdRecipe": 18,
    "Id": 105
  },
  {
    "Name": "Pour semolina into another bowl.",
    "Step": 5,
    "IdRecipe": 18,
    "Id": 106
  },
  {
    "Name": "Mix semolina with melted butter. Add kefir. Mix.",
    "Step": 6,
    "IdRecipe": 18,
    "Id": 107
  },
  {
    "Name": "Add eggs, ground with sugar, salt, soda with vinegar, vanilla to semolina.",
    "Step": 7,
    "IdRecipe": 18,
    "Id": 108
  },
  {
    "Name": "Mix everything well.",
    "Step": 8,
    "IdRecipe": 18,
    "Id": 109
  },
  {
    "Name": "You can leave it for 1 hour to swell the semolina.",
    "Step": 9,
    "IdRecipe": 18,
    "Id": 110
  },
  {
    "Name": "Turn on the oven. Grease the form with oil (you can also sprinkle with semolina). Put the prepared mass in a greased form. Place the dish on the middle shelf.",
    "Step": 10,
    "IdRecipe": 18,
    "Id": 111
  },
  {
    "Name": "Bake the mannik in the oven at 175 degrees until golden brown (about 30-40 minutes).",
    "Step": 11,
    "IdRecipe": 18,
    "Id": 112
  },
  {
    "Name": "Butter mannik is ready.",
    "Step": 12,
    "IdRecipe": 18,
    "Id": 113
  },
  {
    "Name": "Serve mannik with sour cream, jam or jam. Enjoy your meal!",
    "Step": 13,
    "IdRecipe": 18,
    "Id": 114
  },
  {
    "Name": "Let's prepare the ingredients. Let's measure out 650 g of flour (5 glasses with a capacity of 200 ml). During the cooking process, you will need parchment paper.",
    "Step": 1,
    "IdRecipe": 19,
    "Id": 115
  },
  {
    "Name": "Combine sugar, honey, egg and yolk in a bowl, and set aside the white of the second egg in a separate bowl for now.",
    "Step": 2,
    "IdRecipe": 19,
    "Id": 116
  },
  {
    "Name": "Beat the mass with a mixer until smooth.",
    "Step": 3,
    "IdRecipe": 19,
    "Id": 117
  },
  {
    "Name": "Pour kefir and butter into another bowl. Let's mix.",
    "Step": 4,
    "IdRecipe": 19,
    "Id": 118
  },
  {
    "Name": "In a deep bowl, combine the egg mixture and the kefir. Mix them with a whisk.",
    "Step": 5,
    "IdRecipe": 19,
    "Id": 119
  },
  {
    "Name": "Sift flour and baking soda to this liquid mixture.",
    "Step": 6,
    "IdRecipe": 19,
    "Id": 120
  },
  {
    "Name": "Knead a soft dough that sticks a little to your hands. Add a little more flour if necessary. Turn on the oven to heat up to 180 degrees.",
    "Step": 7,
    "IdRecipe": 19,
    "Id": 121
  },
  {
    "Name": "Dust the working surface with flour, lay out the dough, roll out a layer 1 cm thick.Cut circles out of the dough with a round cutting or glass.",
    "Step": 8,
    "IdRecipe": 19,
    "Id": 122
  },
  {
    "Name": "Cover the baking sheet with parchment, lay out the blanks-circles and send them to bake in an oven preheated to 180 degrees for 25 minutes.",
    "Step": 9,
    "IdRecipe": 19,
    "Id": 123
  },
  {
    "Name": "During this time, we will prepare the fondant. To do this, put the egg white set aside earlier in a deep bowl, add sugar.",
    "Step": 10,
    "IdRecipe": 19,
    "Id": 124
  },
  {
    "Name": "Whisk the ingredients until the sugar dissolves.",
    "Step": 11,
    "IdRecipe": 19,
    "Id": 125
  },
  {
    "Name": "After the time has elapsed, remove the baking sheet with gingerbread from the oven. Cover each gingerbread with fondant using a pastry brush. Return the gingerbread baking sheet to the oven for another 10 minutes.",
    "Step": 12,
    "IdRecipe": 19,
    "Id": 126
  },
  {
    "Id": 127,
    "IdRecipe": 19,
    "Name": "Put the finished gingerbread cookies in a basket or on a plate. They turn out to be very soft, their porous texture is clearly visible at the fracture. Have a nice tea!",
    "Step": 13
  }
]